{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "bias": "none",
  "corda_config": null,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "peft_version": "0.18.1",
  "qalora_group_size": 16,
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "model.0.unet_backbone.l_conv.1.conv_pass.0",
    "model.0.unet_backbone.l_conv.3.conv_pass.0",
    "model.0.unet_backbone.l_conv.2.conv_pass.4",
    "model.0.unet_backbone.l_conv.3.conv_pass.2",
    "model.0.unet_backbone.l_conv.1.conv_pass.2",
    "model.0.unet_backbone.l_conv.0.conv_pass.4",
    "model.0.unet_backbone.r_conv.0.0.conv_pass.2",
    "model.0.unet_backbone.r_conv.0.2.conv_pass.2",
    "model.0.unet_backbone.l_conv.2.conv_pass.0",
    "model.0.unet_backbone.l_conv.0.conv_pass.2",
    "model.0.unet_backbone.r_conv.0.2.conv_pass.0",
    "model.0.unet_backbone.l_conv.2.conv_pass.2",
    "model.0.unet_backbone.r_conv.0.1.conv_pass.2",
    "model.0.unet_backbone.l_conv.0.conv_pass.0",
    "model.0.unet_backbone.l_conv.1.conv_pass.4",
    "model.0.unet_backbone.l_conv.3.conv_pass.4",
    "model.0.unet_backbone.r_conv.0.0.conv_pass.0",
    "model.0.unet_backbone.r_conv.0.1.conv_pass.0"
  ],
  "target_parameters": null,
  "task_type": "FEATURE_EXTRACTION",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}